Revit 2027 API
SpecTypeId.DemandFactor Property
 Demand Factor, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DemandFactor { get; }
Public Shared ReadOnly Property DemandFactor As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DemandFactor {
	ForgeTypeId^ get ();
}
static member DemandFactor : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace